tutorials/multiform/resolvedSimulations/reactivePacking3D10cells/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
 momentumSource
 {
     type            vectorSemiImplicitSource;//meanVelocityForce;

     selectionMode   all;
     volumeMode      specific;
     
     fields          (U);
     Ubar            (1 0 0);
     injectionRateSuSp 
     {
         U ( (1 0 0)  0 );
     }
 }


// ************************************************************************* //
