tutorials/multiform/resolvedSimulations/reactivePacking3D10cells/system/geometry1
geometry
{

    circle
    {
        type searchableSphere;
        centre (0 0 0);
        radius 1;
    }

    solid
    {
        type searchableSurfaceCollection;

        mergeSubRegions true;

